app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function listar()
    {
        $clienteModel = new \App\Models\ClienteModel();
        $clientes = $clienteModel->findAll();

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '11'
---
    public function editar($id)
    {
        $clienteModel = new \App\Models\ClienteModel();
        $cliente = $clienteModel->find($id);

INSERT INTO `clientes` (`nome`, `email`, `telefone`, `foto`) VALUES ('Lucio Jorge', 'luciojorge17@gmail.com', '(55) 99140-0414', '1750214082_99cb86fe26f7ee933dfd.png')
---
        if ($id) {
            $clienteModel->update($id, $dados);
        } else {
            $clienteModel->insert($dados);

DELETE FROM `clientes`
WHERE `id` IN ('1')
---
    public function excluir($id)
    {
        $clienteModel = new \App\Models\ClienteModel();
        if ($clienteModel->delete($id)) {